## <span style="color:yellow">***Data Wrangling*** !</span> (Data Pre-processing)

In [322]:
# import Libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [323]:
boat = sns.load_dataset('titanic')
boat1 = sns.load_dataset('titanic')
boat2 = sns.load_dataset('titanic')

In [386]:
boat.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

> ***Simple Operation. (Math operator)***

In [325]:
(boat['age']+1).head(3)

0    23.0
1    39.0
2    27.0
Name: age, dtype: float64

***

> ***Find missing values***

In [326]:
boat.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

***

> ***Find shape of Dataset***

In [327]:
boat.shape

(891, 15)

***

In [328]:
boat.deck.isnull().sum()

688

> ***Remove the missing values of specific column.(deck) in x-axis***

In [329]:
boat.deck.isnull().sum()

688

In [330]:
boat.dropna(subset=['deck'], axis=0, inplace=True)

In [331]:
boat.deck.isnull().sum()

0

***

In [332]:
boat.shape

(203, 15)

In [333]:
boat.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

> ***Remove the missing values from whole Dataset***

In [334]:
boat = boat.dropna()
boat.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

***

In [335]:
boat.shape

(182, 15)

***

***

***

In [336]:
boat1.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [337]:
boat1.shape

(891, 15)

In [338]:
boat1.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

> ***Find mean of age***

In [339]:
age_mean = boat1.age.mean()
age_mean

29.69911764705882

***

> ***Replace the missing values with the average(mean) of that column.(age)***

In [340]:
boat1.age.isnull().sum()

177

In [341]:
boat1['age'] = boat1['age'].replace(np.nan, age_mean)

In [342]:
boat1.age.isnull().sum()

0

***

> ***Remove the missing values of specific column.(deck) in x-axis***

In [343]:
boat1.deck.isnull().sum()

688

In [344]:
boat1.dropna(subset=['deck'], axis=0, inplace=True)

In [345]:
boat1.deck.isnull().sum()

0

***

In [346]:
boat1.shape

(203, 15)

> ***Remove the missing values from whole Dataset***

In [347]:
boat1 = boat1.dropna()
boat1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

***

In [348]:
boat1.shape

(201, 15)

***

***

***

#### **Data Cleaning** !
> #### *Data Formatting/ Duplicate Removal/ Data Standardization*

In [349]:
boat2.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [350]:
boat2.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

> **Convert data-types of indexes**

In [351]:
boat2['survived'].dtypes

dtype('int64')

In [352]:
boat2['survived'] = boat2['survived'].astype('float32')

In [353]:
boat2['survived'].dtypes

dtype('float32')

***

> **Convert age in days**

In [354]:
boat2.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [355]:
boat2['age'] = boat2['age']*365

In [356]:
boat2.age.head()

0     8030.0
1    13870.0
2     9490.0
3    12775.0
4    12775.0
Name: age, dtype: float64

***

> **Rename column (age to age_days)**

In [357]:
boat2.head(1)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0.0,3,male,8030.0,1,0,7.25,S,Third,man,True,NaN,Southampton,no,False

In [358]:
boat2['age'] = boat2.rename(columns={'age': 'age_days'}, inplace=True)

In [359]:
boat2.head(1)

,survived,pclass,sex,age_days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age
0,0.0,3,male,8030.0,1,0,7.25,S,Third,man,True,NaN,Southampton,no,False,None

***

***

***

#### **Data Normalization** / **Human-Readable size** /**Machine-Readable size** ! (Bell curve)
> *Parametric Analysis tests*
> 
> *Non-Parametric Analysis tests*

> **Method of Normalize Data**. (Scaling Method)
> - Simple Feature
> - Min-Max Method
> - Z-score. (Standard Score)
> - log transformation

***

> **Formula's**
> - *Simple Feature*. <span style="color:green">{ set['value'] = set['value'] / set['value'].max() }</span>
> - *Min-Max Method*. <span style="color:violet">{ set['value'] = (set['value']-set['value'].min()) / (set['value'].max()-set['value'].min())}</span>
> - *Z-score. (Standard Score)*. <span style="color:cyan">{ set['value'] = (set['value']-set['value'].mean()) / set['value'].std() }</span>
> - *log transformation*. <span style="color:orange">{ set['value'] = np.log(set['value']) }</span>

> **Simple Feature Scaling** 

> - Range.(0 to 1)

In [360]:
m1 = boat2[['age_days', 'fare']]
m1.head()

   age_days     fare
0    8030.0   7.2500
1   13870.0  71.2833
2    9490.0   7.9250
3   12775.0  53.1000
4   12775.0   8.0500

In [361]:
m1['age_days'] = m1['age_days']/m1['age_days'].max()
m1['fare'] = m1['fare']/m1['fare'].max()

m1.head()

C:\Users\fahad\AppData\Local\Temp\ipykernel_10312\1515070788.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  m1['age_days'] = m1['age_days']/m1['age_days'].max()
C:\Users\fahad\AppData\Local\Temp\ipykernel_10312\1515070788.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  m1['fare'] = m1['fare']/m1['fare'].max()

   age_days      fare
0    0.2750  0.014151
1    0.4750  0.139136
2    0.3250  0.015469
3    0.4375  0.103644
4    0.4375  0.015713

In [362]:
m1.min()

age_days    0.00525
fare        0.00000
dtype: float64

In [363]:
m1.max()

age_days    1.0
fare        1.0
dtype: float64

***

> **Min-Max Scaling Method**

> - Range.(0 to 1)

In [364]:
m2 = boat2[['age_days', 'fare']]
m2.head()

   age_days     fare
0    8030.0   7.2500
1   13870.0  71.2833
2    9490.0   7.9250
3   12775.0  53.1000
4   12775.0   8.0500

In [365]:
m2['age_days'] = (m2['age_days']-m2['age_days'].min()) / (m2['age_days'].max()-m2['age_days'].min())
m2['fare'] = (m2['fare']-m2['fare'].min()) / (m2['fare'].max()-m2['fare'].min())
m2.head()

C:\Users\fahad\AppData\Local\Temp\ipykernel_10312\2700239246.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  m2['age_days'] = (m2['age_days']-m2['age_days'].min()) / (m2['age_days'].max()-m2['age_days'].min())
C:\Users\fahad\AppData\Local\Temp\ipykernel_10312\2700239246.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  m2['fare'] = (m2['fare']-m2['fare'].min()) / (m2['fare'].max()-m2['fare'].min())

   age_days      fare
0  0.271174  0.014151
1  0.472229  0.139136
2  0.321438  0.015469
3  0.434531  0.103644
4  0.434531  0.015713

In [366]:
m2.min()

age_days    0.0
fare        0.0
dtype: float64

In [367]:
m2.max()

age_days    1.0
fare        1.0
dtype: float64

***

> **Z-score Scaling Method** ! (Standard Score)

> - Range.(-3 to +3)

In [368]:
m3 = boat2[['age_days', 'fare']]
m3.head()

   age_days     fare
0    8030.0   7.2500
1   13870.0  71.2833
2    9490.0   7.9250
3   12775.0  53.1000
4   12775.0   8.0500

In [369]:
m3['age_days'] = (m3['age_days']-m3['age_days'].mean()) / (m3['age_days'].std())
m3['fare'] = (m3['fare']-m3['fare'].mean()) / (m3['fare'].std())
m3.head()

C:\Users\fahad\AppData\Local\Temp\ipykernel_10312\3802698713.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  m3['age_days'] = (m3['age_days']-m3['age_days'].mean()) / (m3['age_days'].std())
C:\Users\fahad\AppData\Local\Temp\ipykernel_10312\3802698713.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  m3['fare'] = (m3['fare']-m3['fare'].mean()) / (m3['fare'].std())

   age_days      fare
0 -0.530005 -0.502163
1  0.571430  0.786404
2 -0.254646 -0.488580
3  0.364911  0.420494
4  0.364911 -0.486064

In [370]:
m3.min()

age_days   -2.015566
fare       -0.648058
dtype: float64

In [371]:
m3.max()

age_days    3.462699
fare        9.661740
dtype: float64

> **log transformation**

> - Range.(1 to 1000)

In [372]:
m4 = boat2[['age_days', 'fare']]
m4.head()

   age_days     fare
0    8030.0   7.2500
1   13870.0  71.2833
2    9490.0   7.9250
3   12775.0  53.1000
4   12775.0   8.0500

In [373]:
m4['age_days'] = np.log(m4['age_days'])
m4['fare'] = np.log(m4['fare'])

m4.head()

C:\Users\fahad\AppData\Local\Temp\ipykernel_10312\1973992703.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  m4['age_days'] = np.log(m4['age_days'])
C:\Users\fahad\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\pandas\core\arraylike.py:397: RuntimeWarning: divide by zero encountered in log
  result = getattr(ufunc, method)(*inputs, **kwargs)
C:\Users\fahad\AppData\Local\Temp\ipykernel_10312\1973992703.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  m4['fare'] = np.log(m4['fare'])

   age_days      fare
0  8.990940  1.981001
1  9.537484  4.266662
2  9.157994  2.070022
3  9.455245  3.972177
4  9.455245  2.085672

In [374]:
m4.min()

age_days    5.032397
fare            -inf
dtype: float64

In [375]:
m4.max()

age_days    10.281924
fare         6.238967
dtype: float64

***

***

***

#### **Binning**
<!-- > *Parametric Analysis tests*
> 
> *Non-Parametric Analysis tests* -->

In [376]:
boat4 = boat[['age', 'sex', 'who']]

In [377]:
boat4.age.head()

1     38.0
3     35.0
6     54.0
10     4.0
11    58.0
Name: age, dtype: float64

In [378]:
boat4.age.max()

80.0

In [379]:
# bins = np.linespace(min(boat4['age']), max(boat4['age']), num=80)
# age_groups = ['child', 'young', 'older']

# boat4['age'] = pd.cut(boat4['age'], bins, labels=age_groups, include_lowest=True)
# boat4['age']

***

***

> **Converting Catagorical variables into dummies !**

In [380]:
boat4.sex.head()

1     female
3     female
6       male
10    female
11    female
Name: sex, dtype: object

In [381]:
boat4 = pd.get_dummies(boat4, columns=['sex'])

In [382]:
boat4.head()

     age    who  sex_female  sex_male
1   38.0  woman           1         0
3   35.0  woman           1         0
6   54.0    man           0         1
10   4.0  child           1         0
11  58.0  woman           1         0

***

In [383]:
boat4.who.head()

1     woman
3     woman
6       man
10    child
11    woman
Name: who, dtype: object

In [384]:
boat4 = pd.get_dummies(boat4, columns=['who'])

In [385]:
boat4.head()

     age  sex_female  sex_male  who_child  who_man  who_woman
1   38.0           1         0          0        0          1
3   35.0           1         0          0        0          1
6   54.0           0         1          0        1          0
10   4.0           1         0          1        0          0
11  58.0           1         0          0        0          1

***

***

***

# THE END